Австралия/src/Catalogs/BankStatementProcessingSettings/BankStatementProcessingSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BankStatementProcessingSettings</name>
  <attributes>
    <name>AutomaticallyFillInDebts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataProcessor</name>
    <type>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
    </type>
  </attributes>
  <attributes>
    <name>Encoding</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExportDirectory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileExtensions</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ImportDirectory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseExportToFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseImportFromFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalSettings</name>
    <attributes>
      <name>Setting</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DefaultValue</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/BankStatementProcessingSettings/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

Procedure UpdateSettingsFromDataProcessor(SettingObject, DataProcessorRef) Export
	
	DataProc				= AdditionalReportsAndDataProcessors.ExternalDataProcessorObject(DataProcessorRef);
	SettingsFromDataProc	= DataProc.OnDefineSettings();
	
	FillPropertyValues(SettingObject, SettingsFromDataProc);
	
	TS = SettingObject.AdditionalSettings;
	TS.Clear();
	
	If SettingsFromDataProc.Property("AdditionalSettings") Then
		
		For Each AdditionalSetting In SettingsFromDataProc.AdditionalSettings Do
			
			NewSetting = TS.Add();
			NewSetting.Setting			= AdditionalSetting.Key;
			NewSetting.Value			= AdditionalSetting.Value;
			NewSetting.DefaultValue		= AdditionalSetting.Value;
			
		EndDo;
		
	EndIf;
	
EndProcedure

Function GetAdditionalSettingsStructure(Ref) Export
	
	ReturnStructure = New Structure;
	
	For Each Row In Ref.AdditionalSettings Do
		ReturnStructure.Insert(Row.Setting, Row.Value);
	EndDo;
	
	Return ReturnStructure;
	
EndFunction

#EndRegion

#EndIf
